app/views/compounds/_form.html.haml

SELECT "customers".* FROM "customers"
---
        .col-md-3
          = f.collection_select :customer_id, Customer.all, :id, :name, {}, class: 'form-control select-picker'