app/controllers/compounds_controller.rb

SELECT "compounds".* FROM "compounds"
---
  def index
    @compounds = Compound.all